croc-shop/test/croc-shop-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Croc-Shop Load Test" enabled="true">
      <stringProp name="TestPlan.comments">Performance test for Croc-Shop e-commerce application
- Generate 100 random customers
- Each customer places 10 orders
- Each order contains 2-3 random items
- All data is fake/test data only</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="USER_SERVICE_HOST" elementType="Argument">
            <stringProp name="Argument.name">USER_SERVICE_HOST</stringProp>
            <stringProp name="Argument.value">croc-shop-user.croc-shop</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="USER_SERVICE_PORT" elementType="Argument">
            <stringProp name="Argument.name">USER_SERVICE_PORT</stringProp>
            <stringProp name="Argument.value">3002</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PRODUCT_SERVICE_HOST" elementType="Argument">
            <stringProp name="Argument.name">PRODUCT_SERVICE_HOST</stringProp>
            <stringProp name="Argument.value">croc-shop-product-catalog.croc-shop</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PRODUCT_SERVICE_PORT" elementType="Argument">
            <stringProp name="Argument.name">PRODUCT_SERVICE_PORT</stringProp>
            <stringProp name="Argument.value">3001</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="CART_SERVICE_HOST" elementType="Argument">
            <stringProp name="Argument.name">CART_SERVICE_HOST</stringProp>
            <stringProp name="Argument.value">croc-shop-cart.croc-shop</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="CART_SERVICE_PORT" elementType="Argument">
            <stringProp name="Argument.name">CART_SERVICE_PORT</stringProp>
            <stringProp name="Argument.value">3003</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ORDER_SERVICE_HOST" elementType="Argument">
            <stringProp name="Argument.name">ORDER_SERVICE_HOST</stringProp>
            <stringProp name="Argument.value">croc-shop-order.croc-shop</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ORDER_SERVICE_PORT" elementType="Argument">
            <stringProp name="Argument.name">ORDER_SERVICE_PORT</stringProp>
            <stringProp name="Argument.value">3004</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="NUM_CUSTOMERS" elementType="Argument">
            <stringProp name="Argument.name">NUM_CUSTOMERS</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ORDERS_PER_CUSTOMER" elementType="Argument">
            <stringProp name="Argument.name">ORDERS_PER_CUSTOMER</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <!-- Thread Group for Customer Creation -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Customer Creation" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${NUM_CUSTOMERS}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- Random Customer Data Generator -->
        <RandomVariableConfig guiclass="RandomVariableConfigGui" testclass="RandomVariableConfig" testname="Random First Name" enabled="true">
          <stringProp name="RandomVariableConfig.variableName">randomFirstName</stringProp>
          <stringProp name="RandomVariableConfig.outputFormat">John,Jane,Michael,Emily,David,Sarah,Robert,Lisa,James,Mary,William,Jennifer,George,Linda,Richard,Patricia,Charles,Barbara,Joseph,Elizabeth</stringProp>
          <boolProp name="RandomVariableConfig.perThread">true</boolProp>
          <stringProp name="RandomVariableConfig.seed">12345</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="RandomVariableConfigGui" testclass="RandomVariableConfig" testname="Random Last Name" enabled="true">
          <stringProp name="RandomVariableConfig.variableName">randomLastName</stringProp>
          <stringProp name="RandomVariableConfig.outputFormat">Smith,Johnson,Williams,Brown,Jones,Garcia,Miller,Davis,Rodriguez,Martinez,Hernandez,Lopez,Gonzalez,Wilson,Anderson,Thomas,Taylor,Moore,Jackson,Martin</stringProp>
          <boolProp name="RandomVariableConfig.perThread">true</boolProp>
          <stringProp name="RandomVariableConfig.seed">54321</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="RandomVariableConfigGui" testclass="RandomVariableConfig" testname="Random Street" enabled="true">
          <stringProp name="RandomVariableConfig.variableName">randomStreet</stringProp>
          <stringProp name="RandomVariableConfig.outputFormat">Main,Oak,Pine,Maple,Cedar,Elm,Washington, Lincoln, Park, Walnut, Cherry, Birch, Willow, Spruce, Ash, Hickory, Sycamore, Dogwood, Magnolia, Redwood</stringProp>
          <boolProp name="RandomVariableConfig.perThread">true</boolProp>
          <stringProp name="RandomVariableConfig.seed">98765</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="RandomVariableConfigGui" testclass="RandomVariableConfig" testname="Random City" enabled="true">
          <stringProp name="RandomVariableConfig.variableName">randomCity</stringProp>
          <stringProp name="RandomVariableConfig.outputFormat">Springfield,Riverside,Franklin,Georgetown,Clinton,Greenwood,Newport,Manchester,Salem,Auburn,Hudson,Oxford,Clayton,Winchester,Lebanon,Brandon,Troy,Dexter,Madison</stringProp>
          <boolProp name="RandomVariableConfig.perThread">true</boolProp>
          <stringProp name="RandomVariableConfig.seed">11111</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="RandomVariableConfigGui" testclass="RandomVariableConfig" testname="Random State" enabled="true">
          <stringProp name="RandomVariableConfig.variableName">randomState</stringProp>
          <stringProp name="RandomVariableConfig.outputFormat">CA,NY,TX,FL,IL,PA,OH,GA,NC,MI,NJ,VA,WA,AZ,MA,TN,IN,MO,MD,WI,CO,MN,SC,AL,LA,KY,OK,CT,UT,IA,OR,KS,MS,AR,NE,NV,ID,NH,WV,DE,SD,ND,AK,VT,MT,WY,RI</stringProp>
          <boolProp name="RandomVariableConfig.perThread">true</boolProp>
          <stringProp name="RandomVariableConfig.seed">22222</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="RandomVariableConfigGui" testclass="RandomVariableConfig" testname="Random Zip" enabled="true">
          <stringProp name="RandomVariableConfig.variableName">randomZip</stringProp>
          <stringProp name="RandomVariableConfig.outputFormat">${__Random(10000,99999)}</stringProp>
          <boolProp name="RandomVariableConfig.perThread">true</boolProp>
          <stringProp name="RandomVariableConfig.seed">33333</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="RandomVariableConfigGui" testclass="RandomVariableConfig" testname="Random Phone" enabled="true">
          <stringProp name="RandomVariableConfig.variableName">randomPhone</stringProp>
          <stringProp name="RandomVariableConfig.outputFormat">555-${__Random(100,999)}-${__Random(1000,9999)}</stringProp>
          <boolProp name="RandomVariableConfig.perThread">true</boolProp>
          <stringProp name="RandomVariableConfig.seed">44444</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="RandomVariableConfigGui" testclass="RandomVariableConfig" testname="Random Email" enabled="true">
          <stringProp name="RandomVariableConfig.variableName">randomEmail</stringProp>
          <stringProp name="RandomVariableConfig.outputFormat">${randomFirstName}${randomLastName}${__Random(1,999)}@testmail.com</stringProp>
          <boolProp name="RandomVariableConfig.perThread">true</boolProp>
          <stringProp name="RandomVariableConfig.seed">55555</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        
        <!-- Create Customer Request -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Customer" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "firstName": "${randomFirstName}",
  "lastName": "${randomLastName}",
  "email": "${randomEmail}",
  "phone": "${randomPhone}",
  "address": {
    "street": "${__Random(100,999)} ${randomStreet} St",
    "city": "${randomCity}",
    "state": "${randomState}",
    "zip": "${randomZip}"
  },
  "paymentInfo": {
    "cardNumber": "4111${__Random(1111,9999)}${__Random(1111,9999)}${__Random(1111,9999)}",
    "expiryDate": "${__Random(2025,2030)}-${__Random(1,12)}",
    "cvv": "${__Random(100,999)}"
  }
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${USER_SERVICE_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${USER_SERVICE_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/customers</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        
        <!-- Extract Customer ID -->
        <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Customer ID" enabled="true">
          <stringProp name="JSONPostProcessor.referenceNames">customerId</stringProp>
          <stringProp name="JSONPostProcessor.jsonPathExprs">$.id</stringProp>
          <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          <stringProp name="JSONPostProcessor.defaultValues">-1</stringProp>
        </JSONPostProcessor>
        <hashTree/>
        
        <!-- Store Customer Data -->
        <JSR223Sampler guiclass="JSR223SamplerGui" testclass="JSR223Sampler" testname="Store Customer Data" enabled="true">
          <stringProp name="ScriptLanguage">groovy</stringProp>
          <stringProp name="cacheCompiledScript">true</stringProp>
          <stringProp name="script">// Store customer data for later use in order processing
def customerId = vars.get("customerId")
def firstName = vars.get("randomFirstName")
def lastName = vars.get("randomLastName")
def email = vars.get("randomEmail")

if (customerId != null && customerId != "-1") {
    // Store in a file for later use
    def customerFile = new File("customer_data.csv")
    customerFile.append("${customerId},${firstName},${lastName},${email}\n")
    
    log.info("Created customer: ${customerId} - ${firstName} ${lastName} (${email})")
} else {
    log.error("Failed to create customer for ${firstName} ${lastName}")
}</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      
      <!-- Thread Group for Order Processing -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Order Processing" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${NUM_CUSTOMERS}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- Load Customer Data -->
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Load Customer Data" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">customer_data.csv</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">customerId,customerFirstName,customerLastName,customerEmail</stringProp>
        </CSVDataSet>
        <hashTree/>
        
        <!-- Order Loop -->
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Order Loop" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${ORDERS_PER_CUSTOMER}</stringProp>
        </LoopController>
        <hashTree>
          <!-- Get Products -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Products" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${PRODUCT_SERVICE_HOST}</stringProp>
            <stringProp name="HTTPSampler.port">${PRODUCT_SERVICE_PORT}</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
            <stringProp name="HTTPSampler.path">/products</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          
          <!-- Extract Product List -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Products" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">productList</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$[*].id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">-1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          
          <!-- Select Random Products -->
          <JSR223Sampler guiclass="JSR223SamplerGui" testclass="JSR223Sampler" testname="Select Random Products" enabled="true">
            <stringProp name="ScriptLanguage">groovy</stringProp>
            <stringProp name="cacheCompiledScript">true</stringProp>
            <stringProp name="script">// Get available products and select 2-3 random ones
def productList = vars.get("productList")
if (productList == null || productList.isEmpty()) {
    log.error("No products available")
    return
}

def products = productList.split(",")
def numItemsToSelect = 2 + new Random().nextInt(2) // 2 or 3 items
def selectedProducts = []

Collections.shuffle(products)
for (int i = 0; i < Math.min(numItemsToSelect, products.size()); i++) {
    selectedProducts.add(products[i].trim())
}

def orderItems = []
selectedProducts.each { productId ->
    def quantity = 1 + new Random().nextInt(3) // 1-3 quantity
    orderItems.add("""{"productId": "${productId}", "quantity": ${quantity}}""")
}

vars.put("orderItems", "[" + orderItems.join(",") + "]")
vars.put("numItems", String.valueOf(selectedProducts.size()))

log.info("Customer ${vars.get("customerId")} selected ${selectedProducts.size()} items: ${selectedProducts}")</stringProp>
          </JSR223Sampler>
          <hashTree/>
          
          <!-- Create Order -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Order" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{
  "customerId": "${customerId}",
  "items": ${orderItems},
  "shippingAddress": {
    "street": "${__Random(100,999)} Test St",
    "city": "Test City",
    "state": "TS",
    "zip": "${__Random(10000,99999)}"
  },
  "paymentInfo": {
    "cardNumber": "4111${__Random(1111,9999)}${__Random(1111,9999)}${__Random(1111,9999)}",
    "expiryDate": "${__Random(2025,2030)}-${__Random(1,12)}",
    "cvv": "${__Random(100,999)}"
  }
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${ORDER_SERVICE_HOST}</stringProp>
            <stringProp name="HTTPSampler.port">${ORDER_SERVICE_PORT}</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
            <stringProp name="HTTPSampler.path">/orders</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          
          <!-- Extract Order ID -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Order ID" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">orderId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">-1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          
          <!-- Log Order Creation -->
          <JSR223Sampler guiclass="JSR223SamplerGui" testclass="JSR223Sampler" testname="Log Order" enabled="true">
            <stringProp name="ScriptLanguage">groovy</stringProp>
            <stringProp name="cacheCompiledScript">true</stringProp>
            <stringProp name="script">def customerId = vars.get("customerId")
def orderId = vars.get("orderId")
def numItems = vars.get("numItems")

if (orderId != null && orderId != "-1") {
    def orderFile = new File("order_data.csv")
    orderFile.append("${orderId},${customerId},${numItems},${__time()}\n")
    
    log.info("Created order ${orderId} for customer ${customerId} with ${numItems} items")
} else {
    log.error("Failed to create order for customer ${customerId}")
}</stringProp>
          </JSR223Sampler>
          <hashTree/>
        </hashTree>
      </hashTree>
      
      <!-- Results Collection -->
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">croc-shop-test-results.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
      
      <!-- Summary Report -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">croc-shop-test-summary.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>